# Manipulating Values in a DataFrame

# Changing a single value in a DataFrame

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("../../Data/titanic.csv")

In [4]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

## loc[ 1 is the row, "age" is the column]

In [5]:
titanic.loc[1, "age"] = 66
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  66.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

## Changing multiple values in a DataFrame

In [6]:
titanic.loc[2:5, "age"] = 66
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  66.0      1      0  71.2833        C    C
2         1       3  female  66.0      0      0   7.9250        S  NaN
3         1       1  female  66.0      1      0  53.1000        S    C
4         0       3    male  66.0      0      0   8.0500        S  NaN

## or

In [7]:
titanic.loc[2:4, "age"] = [55,77,88]
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  66.0      1      0  71.2833        C    C
2         1       3  female  55.0      0      0   7.9250        S  NaN
3         1       1  female  77.0      1      0  53.1000        S    C
4         0       3    male  88.0      0      0   8.0500        S  NaN

## Changing multiple values in a row

In [8]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  66.0      1      0  71.2833        C    C
2         1       3  female  55.0      0      0   7.9250        S  NaN
3         1       1  female  77.0      1      0  53.1000        S    C
4         0       3    male  88.0      0      0   8.0500        S  NaN

In [9]:
titanic.loc[0, "survived":"sex"] = [1, 1 , "female_w"]
titanic.head()

   survived  pclass       sex   age  sibsp  parch     fare embarked deck
0         1       1  female_w  22.0      1      0   7.2500        S  NaN
1         1       1    female  66.0      1      0  71.2833        C    C
2         1       3    female  55.0      0      0   7.9250        S  NaN
3         1       1    female  77.0      1      0  53.1000        S    C
4         0       3      male  88.0      0      0   8.0500        S  NaN

## Changing multiple values in multiple rows

In [10]:
titanic.replace(0, "Zero")

    survived  pclass       sex   age sibsp parch     fare embarked deck
0          1       1  female_w  22.0     1  Zero     7.25        S  NaN
1          1       1    female  66.0     1  Zero  71.2833        C    C
2          1       3    female  55.0  Zero  Zero    7.925        S  NaN
3          1       1    female  77.0     1  Zero     53.1        S    C
4       Zero       3      male  88.0  Zero  Zero     8.05        S  NaN
..       ...     ...       ...   ...   ...   ...      ...      ...  ...
886     Zero       2      male  27.0  Zero  Zero     13.0        S  NaN
887        1       1    female  19.0  Zero  Zero     30.0        S    B
888     Zero       3    female   NaN     1     2    23.45        S  NaN
889        1       1      male  26.0  Zero  Zero     30.0        C    C
890     Zero       3      male  32.0  Zero  Zero     7.75        Q  NaN

[891 rows x 9 columns]

# Verify DF is a copy ori a view

In [12]:
view_df = titanic.age
view_df.head()

0    22.0
1    66.0
2    55.0
3    77.0
4    88.0
Name: age, dtype: float64

## Is True because is a view DF of the original DF

In [14]:
view_df._is_view

True

In [17]:
view_df._is_copy is None

True

# How  no affect the original DF
## We use the copy method for not affect the original DF

In [19]:
titanic_baby = titanic.loc[titanic.age < 1 , ["sex", "age"]].copy()
titanic_baby

        sex   age
78     male  0.83
305    male  0.92
469  female  0.75
644  female  0.75
755    male  0.67
803    male  0.42
831    male  0.83

In [21]:
titanic_baby.age = 1
titanic_baby

        sex  age
78     male    1
305    male    1
469  female    1
644  female    1
755    male    1
803    male    1
831    male    1